"""
 Написать функцию, которая принимает список и проверяет - пустой он или нет.
"""


def is_empty(lst):
    return lst == []


print(is_empty([]))
